var awardsData = {
    blagodarnost: {
        2011: ['Палкин Евгений Александрович'],
        2013: [],
        2014: [],
        2015: ['Галахова Нелля Васильевна', 'Данилишин Михаил Николаевич', 'Степанова Оксана Семёновна'],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: [],
        2022: [],
        2023: [],
        2024: []
    },
    gramota: {
        2011: [],
        2013: ['Краев Юрий Геннадьевич', 'Степанова Оксана Семёновна'],
        2014: [],
        2015: [],
        2017: ['Сибагатов Набиулла Ибрагимович', 'Таранов Сергей Алексеевич'],
        2018: ['Данилова Марина Александровна', 'Жаркова Алла Михайловна'],
        2019: ['Кулинец Нина Михайловна'],
        2020: ['Надеин Андрей Анатольевич'],
        2021: [],
        2022: [],
        2023: [],
        2024: []
    },
    gybernator: {
        2011: [],
        2013: ['Самочёрнов Алексей Сергеевич'],
        2014: ['Касьянова Оксана Витальевна', 'Лысков Вячеслав Владимирович'],
        2015: ['Самочёрнов Алексей Сергеевич'],
        2017: ['Никитенко Татьяна Михайловна'],
        2018: [],
        2019: ['Бибиков Сергей Викторович'],
        2020: ['Ширяев Сергей Николаевич'],
        2021: [],
        2022: ['Плебух Наталья Владимировна'],
        2023: ['Сапаров Анвар Рашидович', 'Сирин Александр Васильевич'],
        2024: ['Кулакова Юлия Владимировна', 'Лещенко Татьяна Павловна', 'Лугинин Вячеслав Александрович', 'Моисеев Михаил Анатольевич']
    },
    gramotagub: {
        2011: [],
        2013: [],
        2014: ['Краев Юрий Геннадьевич'],
        2015: [],
        2017: ['Дубова Надежда Афонасьевна', 'Сергеева Наталья Анатольевна'],
        2018: [],
        2019: ['Майдан Светлана Николаевна', 'Решетникова Ольга Ивановна'],
        2020: ['Иванов Сергей Васильевич', 'Альчиков Александр Владимирович'],
        2021: ['Бондарев Николай Николаевич', 'Дронова Инесса Николаевна'],
        2022: ['Холманских Василий Александрович', 'Козлов Павел Леонидович', 'Власенко Александр Михайлович', 'Хорошавина Надежда Алексеевна'],
        2023: [],
        2024: ['Гизатуллин Тахир Нургаянович', 'Вирашкин Евгений Викторович']
    },
    pismo: {
        2011: [],
        2013: [],
        2014: ['Лысков Вячеслав Владимирович', 'Самочёрнов Алексей Сергеевич'],
        2015: ['Дубова Надежда Афонасьевна'],
        2017: [],
        2018: [],
        2019: ['Перевалов Анатолий Владимирович'],
        2020: [],
        2021: [],
        2022: [],
        2023: [],
        2024: ['Соколов Юрий Рафаилович', 'Данилов Сергей Владимирович', 'Шишкин Владимир Николаевич']
    },
    trugenik: {
        2011: [],
        2013: [],
        2014: [],
        2015: [],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: [],
        2022: [],
        2023: ['Дубова Надежда Афонасьевна'],
        2024: []
    },
    lesnou: {
        2011: [],
        2013: [],
        2014: ['Хуснутдинова Фануза Галеевна', 'Данилишин Михаил Николаевич', 'Палкин Евгений Александрович', 'Плебух Яков Михайлович'],
        2015: [],
        2017: [],
        2018: [],
        2019: [],
        2020: ['Самочёрнов Алексей Сергеевич'],
        2021: ['Соколов Юрий Рафаилович', 'Вахрушев Сергей Александрович', 'Ярков Олег Фролович'],
        2022: [],
        2023: [],
        2024: []
    },
    transtort: {
        2011: [],
        2013: [],
        2014: ['Ильин Валерий Николаевич'],
        2015: [],
        2017: [],
        2018: [],
        2019: ['Лысков Вячеслав Владимирович', 'Назаров Андрей Владимирович'],
        2020: [],
        2021: [],
        2022: [],
        2023: [],
        2024: ['Рыкованов Александр Александрович']
    },
    leskom: {
        2011: [],
        2013: [],
        2014: [],
        2015: [],
        2017: ['Сергеева Наталья Анатольевна'],
        2018: [],
        2019: [],
        2020: [],
        2021: [],
        2022: ['Елохов Константин Николаевич'],
        2023: ['Виноградов Сергей Борисович', 'Анкушин Сергей Алексеевич'],
        2024: []
    },
    ministr: {
        2011: [],
        2013: [],
        2014: [],
        2015: [],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: ['Кожевников Юрий Александрович', 'Краев Юрий Геннадьевич'],
        2022: [],
        2023: [],
        2024: []
    },
    znak: {
        2011: [],
        2013: [],
        2014: ['Краев Юрий Геннадьевич'],
        2015: [],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: [],
        2022: [],
        2023: [],
        2024: []
    },
    econom: {
        2011: [],
        2013: [],
        2014: [],
        2015: ['Степанова Оксана Семёновна'],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: [],
        2022: [],
        2023: [],
        2024: []
    },
    gramotaprom: {
        2011: [],
        2013: [],
        2014: [],
        2015: [],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: ['Дорофеев Юрий Владимирович', 'Перовская Ольга Петровна', 'Солдаткин Сергей Николаевич', 'Елохов Владимир Иванович', 'Кораблев Игорь Сергеевич', 'Вахрушев Алексей Сергеевич'],
        2022: ['Лещенко Татьяна Павловна', 'Синявская Татьяна Геннадьевна', 'Таскаев Николай Дмитриевич', 'Немчанов Евгений Васильевич', 'Дойлидов Василий Иванович', 'Заусалин Владимир Николаевич', 'Минибаев Эльнар Раилевич', 'Арсенов Александр Александрович'],
        2023: [],
        2024: []
    },
    depprom: {
        2011: [],
        2013: [],
        2014: [],
        2015: [],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: ['Стёжин Константин Андреевич'],
        2022: ['Барышев Виктор Анатольевич', 'Лемешко Андрей Владимирович'],
        2023: [],
        2024: []
    },
    minprom: {
        2011: [],
        2013: [],
        2014: [],
        2015: [],
        2017: [],
        2018: [],
        2019: [],
        2020: [],
        2021: [],
        2022: ['Палкин Евгений Александрович', 'Плебух Яков Михайлович'],
        2023: ['Сакк Татьяна Петровна', 'Данилишин Михаил Николаевич'],
        2024: []
    },
    
};

document.getElementById('selectYear').addEventListener('change', updateAwardList);
document.getElementById('selectAward').addEventListener('change', updateAwardList);

function updateAwardList() {
    var selectedYear = document.getElementById('selectYear').value;
    var selectedAward = document.getElementById('selectAward').value;
    var awardList = document.getElementById('awardList');

    awardList.innerHTML = '';

    if (selectedYear && selectedAward && awardsData[selectedAward][selectedYear]) {
        var awards = awardsData[selectedAward][selectedYear];
        if (awards.length > 0) {
            awards.forEach(function(person) {
                var listItem = document.createElement('div');
                listItem.textContent = person;
                awardList.appendChild(listItem);
            });
        } else {
            awardList.textContent = 'Награды в выбранном году отсутствуют';
        }
    } else {
        awardList.textContent = 'Выберите год и награду для отображения списка награждённых.';
    }
}